Учет_кабельной_продукции/src/Catalogs/Координаты/Координаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Координаты</name>
  <attributes>
    <name>X</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Y</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Z</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Учет_кабельной_продукции/src/Catalogs/Координаты/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	Если СтрЗаменить(X, " ", "") = "" И СтрЗаменить(Y, " ", "") = "" И СтрЗаменить(Z, " ", "") = "" Тогда
		Возврат;	
	КонецЕсли;
	
	СтрокаКоординат = "" + Формат(X, "ЧГ=0");	
	СтрокаКоординат = СтрокаКоординат + ?(ЗначениеЗаполнено(СтрокаКоординат), "/", "") + Формат(Y, "ЧГ=0");  	
	СтрокаКоординат = СтрокаКоординат + ?(ЗначениеЗаполнено(СтрокаКоординат), "/", "") + Формат(Z, "ЧГ=0");	
	Наименование    = СтрокаКоординат;
	
	Отказ = ОбщегоНазначенияПереопределяемый.ПроверитьОбъектУникален(Ссылка, Наименование, "Координаты", Отказ); 	
	
КонецПроцедуры
